# Data Preprocessing in Python

## Importing Dependencies and uploading our data

In [0]:
import pandas as pd
import numpy as np
from google.colab import files
import math

In [0]:
data = files.upload()

### Sanity check to ensure our data was successfully uploaded

In [2]:
!ls

mock_data_preprocessing.csv  sample_data

## Data Exploration

In [0]:
dataset = pd.read_csv('mock_data_preprocessing.csv')

In [4]:
dataset.head(9)

   Id  Age Siblings Height  ...  Vehicle  Travel Distance    Education      Salary
0  x1   23     None    5’5  ...      Car             60km   Bachelor’s     $60,000
1  x2   20        2    6’0  ...  Bicycle             20km  High-School     $20,000
2  x3   40        1   4’10  ...      Bus             40km     Master’s     $75,000
3  x4   21        6      0  ...     Taxi             50km  High-School  $2,000,000
4  x5   42        0    5’8  ...      Bus             35km        Ph.D.     $80,000
5  x5   42        0    5’8  ...      Bus             35km        Ph.D.     $80,000
6  x1   23     None    5’5  ...      Car             60km   Bachelor’s     $60,000
7  x7   24        1    5’8  ...     Foot              3km   Bachelor’s    $100,000
8  x8   35        4    5’3  ...      Bus             15km     Master’s     $50,000

[9 rows x 10 columns]

### Note:
.describe() is only showing us the Age and BMI columns because they are the only columns with only numbers in them. This is a sign that all the other columns will need to be processed to some degree as well.

In [5]:
print(dataset.describe())
print('============================')
print(dataset.dtypes)

             Age         BMI
count   9.000000    9.000000
mean   30.000000  132.133333
std     9.539392  325.087242
min    20.000000   17.700000
25%    23.000000   23.300000
50%    24.000000   23.700000
75%    40.000000   27.400000
max    42.000000  999.000000
============================
Id                  object
Age                  int64
Siblings            object
Height              object
Weight              object
BMI                float64
Vehicle             object
Travel Distance     object
Education           object
Salary              object
dtype: object

## Data Preprocessing

### Duplicates

To reduce the amount of computation required to clean the data we will first remove any existing duplicates.

**TODO**

1.) Check if there are any duplicate rows

2.) Remove any duplicate rows

**Note:** Make sure to keep one copy of any duplicates found in the dataset

In [0]:
data = dataset.drop_duplicates()

### Age

In order to prepare our data for training we will normalize all our data to be between 0 and 1.

**Note:** When normalizing data only look at the values of the feature/column being normalized

**TODO**

1.) Find the minimum age

2.) Find the maximum age

3.) Normalize all the age values

**Note**

The normalize formula is as follows:

$$ X_{new} = \frac{X - X_{min}}  {X_{max} - X_{min}}$$

In [180]:
def normi(x):
  x_min=min(x)
  x_max=max(x)
  x_nomralized=[]
  for i in range(len(x)):
    y=(x[i]-x_min)/(x_max-x_min)
    x_nomralized.append(y)
  return x_nomralized
age=np.array(data.Age)
print(age)
normalized_age= normi(age)
print(normalized_age)

[23 20 40 21 42 24 35]
[0.13636363636363635, 0.0, 0.9090909090909091, 0.045454545454545456, 1.0, 0.18181818181818182, 0.6818181818181818]

### Siblings

Under Siblings we notice that we have a Value of "None". This could be due to an error or it could mean that they have no siblings. Either way we need to convert this to a number.

**Todo**

1.) Replace any None values in Siblings with 0

2.) Find the minimum value

3.) Find the maximum value

4.) Normalize the siblings values

**Note**

Only numerical data types(ints, floats) can be normalized.

In [181]:

siblings=data['Siblings']
siblings.replace('None', 0, inplace=True)
data.head(10)

siblings_array=np.array(siblings)
y=[int(k) for k in siblings_array]
  
print(y)
normalized_siblings= normi(y)
print(normalized_siblings)

[0, 2, 1, 6, 0, 1, 4]
[0.0, 0.3333333333333333, 0.16666666666666666, 1.0, 0.0, 0.16666666666666666, 0.6666666666666666]

/usr/local/lib/python3.6/dist-packages/pandas/core/generic.py:6786: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(new_data)

### Height, Weight and BMI
The BMI column allows us to deal with these three columns at the same time. We can use the following formula to fix any missing values as well:

$$BMI = \frac{703 * Weight_{pounds}}  {Height_{inches}^2} $$

**TODO**

1.) Convert the Height values to inches

2.) Remove 'lbs' from the Weight values

3.) Find and fix the outlier in the BMI column

4.) Find and fix the 0 value in Height

5.) Normalize all three columns

In [182]:
my_str = 'lbs112 lbs'
my_str.rstrip('lbsxbdiosjdf ')


data.head(10)
height=np.array(data.Height)
weight=np.array(data.Weight)
print(height)
print(weight)


# height_ft = height[0].split("’")[0]
# print(height_ft)
# height_inch = height[0].split("'")[1].split("\"")[0]

height_inches=[]
for x in height:
  if x=='0':
    x = '0’0'
  height_ft = x.split("’")[0]
  height_inch = x.split("’")[1] #.split("\"")[0]
  x= 12*int(height_ft) + int(height_inch)
  height_inches.append(x)
print (height_inches)

weight_lbs=[]
for x in weight:
  number= x.split('lbs')[0]
  weight_lbs.append(int(number))

print (weight_lbs)



BMI=[]
for i in range(len(weight_lbs)):
  if height_inches[i]==0:
    y=0
    
  else:
    y= (703*weight_lbs[i])/(height_inches[i]**2)
  BMI.append(y)

print(BMI)

normalized_height=normi(height_inches)
normalized_weight=normi(weight_lbs)
normalized_BMI=normi(BMI)

['5’5' '6’0' '4’10' '0' '5’8' '5’8' '5’3']
['140lbs' '175lbs' '100lbs' '130lbs' '180' '155lbs' '100lbs']
[65, 72, 58, 0, 68, 68, 63]
[140, 175, 100, 130, 180, 155, 100]
[23.294674556213018, 23.73167438271605, 20.897740784780023, 0, 27.3659169550173, 23.565095155709344, 17.712270093222475]

### Vehicle
The entries in the Vehicle column each have text representing that cell's value. Since ML models require numerical data to work, we will need to encode the categorical values into a numerical form. One-Hot encoding is a popular way of dealing with categorical data.

One-Hot encoding works by creating multiple boolean variables and assigning each variable to one category.

**ex.** If our categories were Cat, Dog, Bird. We can encode them as followed: Cat = 1 0 0,  Dog = 0 1 0, Bird = 0 0 1
<br>

**TODO**

1.) Create a copy of the Vehicle column

2.) Convert the copy into a One-Hot representation

3.) Delete the original Vehicle column

4.) Add the One-Hot encoded representation back into the dataset

In [183]:
vehicle= (data.Vehicle).copy()
vehicle.head(10)

k=[]
for x in vehicle:
  if x == 'Car':
    x = '1 0 0 0 0'
  if x == 'Bicycle':
    x= '0 1 0 0 0'
  if x== 'Bus':
    x= '0 0 1 0 0'
  if x == 'Taxi':
    x = '0 0 0 1 0'
  if x == 'Foot':
    x = '0 0 0 0 1'
  k.append(x)
print (k)

data.drop(columns='Vehicle', inplace=True)
data['Vehicle']=k
data.head(10)

['1 0 0 0 0', '0 1 0 0 0', '0 0 1 0 0', '0 0 0 1 0', '0 0 1 0 0', '0 0 0 0 1', '0 0 1 0 0']

/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:4117: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:20: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

   Id  Age Siblings Height  ... Travel Distance    Education      Salary    Vehicle
0  x1   23        0    5’5  ...            60km   Bachelor’s     $60,000  1 0 0 0 0
1  x2   20        2    6’0  ...            20km  High-School     $20,000  0 1 0 0 0
2  x3   40        1   4’10  ...            40km     Master’s     $75,000  0 0 1 0 0
3  x4   21        6      0  ...            50km  High-School  $2,000,000  0 0 0 1 0
4  x5   42        0    5’8  ...            35km        Ph.D.     $80,000  0 0 1 0 0
7  x7   24        1    5’8  ...             3km   Bachelor’s    $100,000  0 0 0 0 1
8  x8   35        4    5’3  ...            15km     Master’s     $50,000  0 0 1 0 0

[7 rows x 10 columns]

### Travel Distance

Just as with Weights column, we need to remove the units and normalize the values.

**TODO**

1.) Remove the km unit from all the values in the Travel Distance column

2.) Normalize all the values in the columns

In [184]:
distance=data['Travel Distance']

distance_no_unit=[]
for x in distance:
  number= x.split('km')[0]
  distance_no_unit.append(int(number))

print (distance_no_unit)

normalized_distance=normi(distance_no_unit)

[60, 20, 40, 50, 35, 3, 15]

### Education

Once again we are dealing with text values in the Education column. This time though since the categories can be ordered,  we are dealing with ordinal data instead. This allows us to encode the data differently in order to limit the number of columns in our dataset.

Instead of using One-Hot encoding which will have us add k-1 columns to our dataset, we will encode all the categories in one column.

**Ex.:** If our data was: Beginner, Intermediate, Advance. Instead of encoding as One-Hot, we can encode it as followed: Beginner = 0, Intermediate = 1, Advance = 2.

**Note:** There are still issues with encoding data like this as we are saying that the distance between each category is the same. Depending on the data this may not be true.

 **TODO**
 
 1.) Create a mapping from category to number. Keep in mind that since we are dealing with ordinal data we want to preserve the order of the values after the encoding
 
 2.) Use the mapping to convert the values in the Education column into numbers
 
 3.) Normalize the values

In [185]:
education=data.Education

education.head(10)


education_level=[]
for x in education:
  if x == 'Bachelor’s':
    x = '1'
  if x == 'High-School':
    x= '0'
  if x== 'Master’s':
    x= '2'
  if x == 'Ph.D.':
    x = '3'
  education_level.append(int(x))
print (education_level)

normalized_education=normi(education_level)

[1, 0, 2, 0, 3, 1, 2]

### Salary
The values in the Salary column contain special characters that we need to remove in order for our models to work

**TODO**

1.) Remove all the special characters

2.) Deal with any outliers

3.) Normalize the data

In [186]:
salary=data.Salary
salary.head()

salary_no_unit=[]
for x in salary:
  if x=='0':
    x = '0’0'
  number = x.split(",")[:]
  x= ''.join(number)
  number_no_unit= x.split("$")[1]
  salary_no_unit.append(int(number_no_unit))
print (salary_no_unit)

normalized_salary=normi(salary_no_unit)

[60000, 20000, 75000, 2000000, 80000, 100000, 50000]

## Our Clean Data

In [211]:
# dataset.head(7)

clean_data=[normalized_age, normalized_distance, normalized_education, normalized_height, normalized_weight, normalized_BMI, normalized_salary,normalized_siblings]
normalized_data = pd.DataFrame(data=clean_data, index=None, columns=["Age", "Distance","Education","Height","Weight","BMI","Salary"])


normalized_data.head(7)

        Age  Distance  Education    Height    Weight       BMI    Salary
0  0.136364  0.000000   0.909091  0.045455  1.000000  0.181818  0.681818
1  1.000000  0.298246   0.649123  0.824561  0.561404  0.000000  0.210526
2  0.333333  0.000000   0.666667  0.000000  1.000000  0.333333  0.666667
3  0.902778  1.000000   0.805556  0.000000  0.944444  0.944444  0.875000
4  0.500000  0.937500   0.000000  0.375000  1.000000  0.687500  0.000000
5  0.851229  0.867198   0.763641  0.000000  1.000000  0.861111  0.647238
6  0.020202  0.000000   0.027778  1.000000  0.030303  0.040404  0.015152

In [212]:
print(normalized_data.describe())
print('============================')
print(normalized_data.dtypes)

            Age  Distance  Education    Height    Weight       BMI    Salary
count  8.000000  8.000000   8.000000  8.000000  8.000000  8.000000  8.000000
mean   0.467988  0.429535   0.498565  0.405627  0.692019  0.401910  0.470383
std    0.408413  0.439968   0.371162  0.463885  0.443516  0.375589  0.340750
min    0.000000  0.000000   0.000000  0.000000  0.000000  0.000000  0.000000
25%    0.107323  0.000000   0.131944  0.000000  0.428628  0.135101  0.161683
50%    0.416667  0.315789   0.657895  0.210227  0.972222  0.257576  0.656952
75%    0.864117  0.884774   0.774120  0.868421  1.000000  0.730903  0.670455
max    1.000000  1.000000   0.909091  1.000000  1.000000  0.944444  0.875000
============================
Age          float64
Distance     float64
Education    float64
Height       float64
Weight       float64
BMI          float64
Salary       float64
dtype: object